; domain
(define (domain depot)
(:requirements :typing :fluents)
(:types place locatable - object
  depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions
  (load_limit ?t - truck)
  (current_load ?t - truck)
  (weight ?c - crate)
  (fuel-cost)
)

(:action drive
:parameters (?x - truck ?y - place ?z - place)
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
    (increase (fuel-cost) 10)))

(:action lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x))
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action drop
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
    (on ?y ?z)))

(:action load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
    (<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
    (increase (current_load ?z) (weight ?y))))

(:action unload
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
    (decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob81) (:domain depot)
(:objects
  depot0 - depot
  distributor0 distributor1 - distributor
  truck0 truck1 - truck
  pallet0 pallet1 pallet2 - pallet
  crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - crate
  hoist0 hoist1 hoist2 - hoist)
(:init
  (at pallet0 depot0)
  (clear crate6)
  (at pallet1 distributor0)
  (clear crate9)
  (at pallet2 distributor1)
  (clear crate8)
  (at truck0 distributor1)
  (= (current_load truck0) 0)
  (= (load_limit truck0) 438)
  (at truck1 distributor0)
  (= (current_load truck1) 0)
  (= (load_limit truck1) 331)
  (at hoist0 depot0)
  (available hoist0)
  (at hoist1 distributor0)
  (available hoist1)
  (at hoist2 distributor1)
  (available hoist2)
  (at crate0 depot0)
  (on crate0 pallet0)
  (= (weight crate0) 4)
  (at crate1 distributor1)
  (on crate1 pallet2)
  (= (weight crate1) 41)
  (at crate2 distributor1)
  (on crate2 crate1)
  (= (weight crate2) 91)
  (at crate3 distributor0)
  (on crate3 pallet1)
  (= (weight crate3) 81)
  (at crate4 depot0)
  (on crate4 crate0)
  (= (weight crate4) 77)
  (at crate5 distributor1)
  (on crate5 crate2)
  (= (weight crate5) 33)
  (at crate6 depot0)
  (on crate6 crate4)
  (= (weight crate6) 17)
  (at crate7 distributor1)
  (on crate7 crate5)
  (= (weight crate7) 27)
  (at crate8 distributor1)
  (on crate8 crate7)
  (= (weight crate8) 88)
  (at crate9 distributor0)
  (on crate9 crate3)
  (= (weight crate9) 46)
  (= (fuel-cost) 0)
)

(:goal (and
    (on crate0 pallet1)
    (on crate1 crate5)
    (on crate2 crate1)
    (on crate3 pallet0)
    (on crate4 crate3)
    (on crate5 crate6)
    (on crate6 pallet2)
    (on crate7 crate4)
    (on crate8 crate2)
  )
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate9 crate3 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate3)
   added: (lifting hoist1 crate9) (clear crate3)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 9
2. (load hoist1 crate9 truck1 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 46
   goals met: 1 of 9
3. (lift hoist1 crate3 pallet1 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 9
4. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   changed: (current_load truck1) from 46 to 127
   goals met: 1 of 9
5. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 1 of 9
6. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck1) from 127 to 46
   goals met: 1 of 9
7. (lift hoist2 crate8 crate7 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate7)
   added: (lifting hoist2 crate8) (clear crate7)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 9
8. (load hoist2 crate8 truck0 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 88
   goals met: 1 of 9
9. (lift hoist2 crate7 crate5 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 crate5)
   added: (lifting hoist2 crate7) (clear crate5)
   changed: (fuel-cost) from 13 to 14
   goals met: 1 of 9
10. (load hoist2 crate7 truck0 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 88 to 115
   goals met: 1 of 9
11. (lift hoist2 crate5 crate2 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate2)
   added: (lifting hoist2 crate5) (clear crate2)
   changed: (fuel-cost) from 14 to 15
   goals met: 1 of 9
12. (load hoist2 crate5 truck0 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   changed: (current_load truck0) from 115 to 148
   goals met: 1 of 9
13. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 148 to 60
   goals met: 1 of 9
14. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   changed: (current_load truck1) from 46 to 127
   goals met: 1 of 9
15. (lift hoist0 crate6 crate4 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate4)
   added: (lifting hoist0 crate6) (clear crate4)
   changed: (fuel-cost) from 15 to 16
   goals met: 1 of 9
16. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   changed: (current_load truck1) from 127 to 144
   goals met: 1 of 9
17. (lift hoist0 crate4 crate0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate0)
   added: (lifting hoist0 crate4) (clear crate0)
   changed: (fuel-cost) from 16 to 17
   goals met: 1 of 9
18. (load hoist2 crate8 truck0 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 60 to 148
   goals met: 1 of 9
19. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 17 to 27
   goals met: 1 of 9
20. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck1) from 144 to 127
   goals met: 1 of 9
21. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 27 to 37
   goals met: 1 of 9
22. (drop hoist2 crate6 crate2 distributor1)
   deleted: (lifting hoist2 crate6) (clear crate2)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 crate2)
   goals met: 1 of 9
23. (unload hoist2 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck0) from 148 to 115
   goals met: 1 of 9
24. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 127 to 204
   goals met: 1 of 9
25. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 37 to 38
   goals met: 1 of 9
26. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   changed: (current_load truck1) from 204 to 208
   goals met: 1 of 9
27. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck1) from 208 to 127
   goals met: 1 of 9
28. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 2 of 9
29. (unload hoist0 crate4 truck1 depot0)
   deleted: (in crate4 truck1) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck1) from 127 to 50
   goals met: 2 of 9
30. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 38 to 48
   goals met: 2 of 9
31. (drop hoist0 crate4 crate3 depot0)
   deleted: (lifting hoist0 crate4) (clear crate3)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate3)
   goals met: 3 of 9
32. (unload hoist1 crate0 truck1 distributor0)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck1) from 50 to 46
   goals met: 3 of 9
33. (drop hoist1 crate0 pallet1 distributor0)
   deleted: (lifting hoist1 crate0) (clear pallet1)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 pallet1)
   goals met: 4 of 9
34. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 48 to 58
   goals met: 4 of 9
35. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 115 to 88
   goals met: 4 of 9
36. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 58 to 68
   goals met: 4 of 9
37. (drop hoist0 crate7 crate4 depot0)
   deleted: (lifting hoist0 crate7) (clear crate4)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 crate4)
   goals met: 5 of 9
38. (load hoist2 crate5 truck0 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   changed: (current_load truck0) from 88 to 121
   goals met: 5 of 9
39. (lift hoist2 crate6 crate2 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate2)
   added: (lifting hoist2 crate6) (clear crate2)
   changed: (fuel-cost) from 68 to 69
   goals met: 5 of 9
40. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 121 to 138
   goals met: 5 of 9
41. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 138 to 50
   goals met: 5 of 9
42. (drop hoist2 crate8 crate2 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate2)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate2)
   goals met: 6 of 9
43. (unload hoist2 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 50 to 33
   goals met: 6 of 9
44. (drop hoist2 crate6 crate8 distributor1)
   deleted: (lifting hoist2 crate6) (clear crate8)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 crate8)
   goals met: 6 of 9
45. (lift hoist2 crate6 crate8 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate8)
   added: (lifting hoist2 crate6) (clear crate8)
   changed: (fuel-cost) from 69 to 70
   goals met: 6 of 9
46. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 33 to 50
   goals met: 6 of 9
47. (lift hoist2 crate8 crate2 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate2)
   added: (lifting hoist2 crate8) (clear crate2)
   changed: (fuel-cost) from 70 to 71
   goals met: 5 of 9
48. (load hoist2 crate8 truck0 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 50 to 138
   goals met: 5 of 9
49. (lift hoist2 crate2 crate1 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate1)
   added: (lifting hoist2 crate2) (clear crate1)
   changed: (fuel-cost) from 71 to 72
   goals met: 4 of 9
50. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 138 to 229
   goals met: 4 of 9
51. (lift hoist2 crate1 pallet2 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   changed: (fuel-cost) from 72 to 73
   goals met: 4 of 9
52. (load hoist2 crate1 truck0 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck0) (available hoist2)
   changed: (current_load truck0) from 229 to 270
   goals met: 4 of 9
53. (unload hoist2 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 270 to 253
   goals met: 4 of 9
54. (drop hoist2 crate6 pallet2 distributor1)
   deleted: (lifting hoist2 crate6) (clear pallet2)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 pallet2)
   goals met: 5 of 9
55. (unload hoist2 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck0) from 253 to 220
   goals met: 5 of 9
56. (drop hoist2 crate5 crate6 distributor1)
   deleted: (lifting hoist2 crate5) (clear crate6)
   added: (available hoist2) (at crate5 distributor1) (clear crate5) (on crate5 crate6)
   goals met: 6 of 9
57. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 220 to 179
   goals met: 6 of 9
58. (drop hoist2 crate1 crate5 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate5)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate5)
   goals met: 7 of 9
59. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck0) from 179 to 88
   goals met: 7 of 9
60. (drop hoist2 crate2 crate1 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate1)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 crate1)
   goals met: 8 of 9
61. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 88 to 0
   goals met: 8 of 9
62. (drop hoist2 crate8 crate2 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate2)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate2)
   goals met: 9 of 9
